In [25]:
import pandas as pd
import numpy as np

# 데이터 불러오기

In [3]:
df = pd.read_csv('data/world_cities.csv', index_col=0)
df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

# 데이터 확인

In [4]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 249
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City / Urban area    249 non-null    object
 1   Country              249 non-null    object
 2   Population           249 non-null    int64
 3   Land area (in sqKm)  249 non-null    int64
dtypes: int64(2), object(2)
memory usage: 9.7+ KB

# 1. 총 몇 개의 도시와 몇 개의 나라가 있는가

## 도시

In [11]:
df.iloc[:,0].describe()

count              249
unique             249
top       Buenos Aires
freq                 1
Name: City / Urban area, dtype: object

## 나라

In [12]:
df.iloc[:,1].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

# 2. 인구밀도가 10000이 넘는 도시는 총 몇 개인가

### 인구밀도 = 인구 수 / 땅의 면적 (in sqKm)

In [18]:
df[df.iloc[:,2] / df.iloc[:,3] > 10000].shape

(19, 4)

# 3. 인구 밀도가 가장 높은 도시를 찾아보자

## 새로운 컬럼 (인구밀도) 생성

In [22]:
df['Density'] = df.iloc[:,2] / df.iloc[:,3]
df

,City / Urban area,Country,Population,Land area (in sqKm),Density
0,Buenos Aires,Argentina,11200000,2266,4942.630185
1,Melbourne,Australia,3162000,2080,1520.192308
2,Sydney,Australia,3502000,1687,2075.874333
3,Brisbane,Australia,1508000,1603,940.736120
4,Perth,Australia,1177000,964,1220.954357
...,...,...,...,...,...
245,Canton,USA,267000,372,717.741935
246,Spokane,USA,335000,371,902.964960
247,Tashkent,Uzbekistan,2200000,531,4143.126177
248,Ho Chi Minh City,Vietnam,4900000,518,9459.459459
249,Harare,Zimbabwe,1750000,712,2457.865169

## 인구밀도 컬럼 기준 내림차순으로 데이터 정렬

In [24]:
df.sort_values(by="Density", ascending=False)

    City / Urban area   Country  Population  Land area (in sqKm)       Density
75             Mumbai     India    14350000                  484  29648.760331
74            Kolkata     India    12700000                  531  23917.137476
101           Karachi  Pakistan     9800000                  518  18918.918919
99              Lagos   Nigeria    13400000                  738  18157.181572
34           Shenzhen     China     8000000                  466  17167.381974
..                ...       ...         ...                  ...           ...
195       Chattanooga       USA      344000                  751    458.055925
224         Asheville       USA      222000                  536    414.179104
57                Pau    France      181000                  450    402.222222
221           Hickory       USA      188000                  546    344.322344
197   Barnstable Town       USA      244000                  741    329.284750

[249 rows x 5 columns]

# 4개의 도시가 나온 나라 찾기

In [40]:
df["Country"].value_counts().sort_values(ascending=False).head(15)

USA             105
France           15
Brazil           10
Canada            9
Germany           8
Australia         6
China             6
India             6
South Africa      6
Japan             5
UK                5
Italy             4
Russia            3
Mexico            3
UAE               2
Name: Country, dtype: int64

In [41]:
countries = df["Country"].value_counts()
countries[countries == 4]

Italy    4
Name: Country, dtype: int64